package com.zdmoney.credit.common.constant;

/**
 * 流程小状态
 * @author 00232949
 *
 */
public enum LoanFlowStateEnum {
	申请("申请"),
	交件审核("交件审核"),
	交件退回("交件退回"),
	审核任务分配("审核任务分配"),
	审核("审核"),
	审核退回("审核退回"),
	审核回退("审核回退"),
	审核拒绝("审核拒绝"),
	中心经理审批("中心经理审批"),
	审批退回("审批退回"),
	审批回退("审批回退"),
	高级审批("高级审批"),
	高级审批退回("高级审批退回"),
	高审回退审核("高审回退审核"),
	高级协审("高级协审"),
	高级协审退回("高级协审退回"),
	高级协审回退审核("高级协审回退审核"),
	风控经理审批("风控经理审批"),
	风控审批退回("风控审批退回"),
	风控经理回退("风控经理回退"),
	总助审批("总助审批"),
	总助审批退回("总助审批退回"),
	总助回退("总助回退"),
	总经理审批("总经理审批"),
	总经理审批退回("总经理审批退回"),
	总经理回退("总经理回退"),
	合同签订("合同签订"),
	合同确认("合同确认"),
	网点经理退回("网点经理退回"),
	财务审核("财务审核"),
	财务审核退回("财务审核退回"),
	财务审核回退("财务审核回退"),
	财务放款("财务放款"),
	财务放款退回("财务放款退回"),
	财务放款回退("财务放款回退"),
	正常("正常"),
	拒绝("拒绝"),
	取消("取消"),
	恢复签约("恢复签约"),
	重新提交("重新提交"),
	复议申请("复议申请"),
	复议批复("复议批复"),
	区域总审批("区域总审批"),
	信贷综合管理部审批("信贷综合管理部审批"),
	信贷综合管理部经理审批("信贷综合管理部经理审批"),
	分管领导审批("分管领导审批");
	
	
	/** value*/
	private String value;
	
	private LoanFlowStateEnum( String value) {
		this.value = value;
	}


	public String getValue() {
		return value;
	}

	public void setValue(String value) {
		this.value = value;
	}
	
}
