package com.zdmoney.credit.common.constant;

/**
 * tpp2.0的信息类别
 * 
 * @author 00232949
 *
 */
public enum TPPInfoCategoryCodeEnum {

    信贷华澳信托实时划扣("10002", "信贷华澳信托实时划扣"), 
    信贷华澳信托提前扣款("10003", "信贷华澳信托提前扣款"), 
    信贷华澳信托正常扣款("10004", "信贷华澳信托正常扣款"), 
    信贷华澳信托逾期M1划扣("10005", "信贷华澳信托逾期M1划扣"), 
    信贷华澳信托逾期M2以上划扣("10006", "信贷华澳信托逾期M2以上划扣"), 
    信贷个贷实时划扣("10007", "信贷个贷实时划扣"),
    信贷个贷提前扣款("10008", "信贷个贷提前扣款"),
    信贷个贷正常扣款("10009", "信贷个贷正常扣款"), 
    信贷个贷逾期M1划扣("10010", "信贷个贷逾期M1划扣"), 
    信贷个贷逾期M2以上划扣("10011", "信贷个贷逾期M2以上划扣"), 
    信贷挖财实时划扣("10012", "信贷挖财实时划扣"), 
    信贷挖财提前扣款("10013", "信贷挖财提前扣款"), 
    信贷挖财正常扣款("10014", "信贷挖财正常扣款"), 
    信贷挖财逾期M1划扣("10015", "信贷挖财逾期M1划扣"), 
    信贷挖财逾期M2以上划扣("10016", "信贷挖财逾期M2以上划扣"), 
    信贷国民信托实时划扣("10017", "信贷国民信托实时划扣"), 
    信贷国民信托提前扣款("10018", "信贷国民信托提前扣款"), 
    信贷国民信托正常扣款("10019", "信贷国民信托正常扣款"), 
    信贷国民信托逾期M1划扣("10020", "信贷国民信托逾期M1划扣"), 
    信贷国民信托逾期M2以上划扣("10021", "信贷国民信托逾期M2以上划扣"), 
    信贷车企贷实时划扣("10022", "信贷车企贷实时划扣"), 
    信贷车企贷逾期划扣("10023", "信贷车企贷逾期划扣"), 
    信贷渤海信托实时划扣("10026", "信贷渤海信托实时划扣"), 
    信贷渤海信托提前扣款("10027", "信贷渤海信托提前扣款"), 
    信贷渤海信托正常扣款("10028", "信贷渤海信托正常扣款"), 
    信贷渤海信托逾期M1划扣("10029", "信贷渤海信托逾期M1划扣"), 
    信贷渤海信托逾期M2以上划扣("10030", "信贷渤海信托逾期M2以上划扣"),
    信贷龙信小贷实时划扣("10033", "信贷龙信小贷实时划扣"), 
    信贷龙信小贷提前扣款("10034", "信贷龙信小贷提前扣款"), 
    信贷龙信小贷正常扣款("10035", "信贷龙信小贷正常扣款"), 
    信贷龙信小贷逾期M1划扣("10036", "信贷龙信小贷逾期M1划扣"), 
    信贷龙信小贷逾期M2以上划扣("10037", "信贷龙信小贷逾期M2以上划扣"),
    信贷渤海信托2实时划扣("10040", "信贷渤海信托2实时划扣"), 
    信贷渤海信托2提前扣款("10041", "信贷渤海信托2提前扣款"), 
    信贷渤海信托2正常扣款("10042", "信贷渤海信托2正常扣款"), 
    信贷渤海信托2逾期M1划扣("10043", "信贷渤海信托2逾期M1划扣"), 
    信贷渤海信托2逾期M2以上划扣("10044", "信贷渤海信托2逾期M2以上划扣"),
    信贷捞财宝实时划扣("10045","信贷捞财宝实时划扣"),
    信贷捞财宝提前扣款("10046","信贷捞财宝提前扣款"),
    信贷捞财宝正常扣款("10047","信贷捞财宝正常扣款"),
    信贷捞财宝逾期M1划扣("10048","信贷捞财宝逾期M1划扣"),
    信贷捞财宝逾期M2以上划扣("10049","信贷捞财宝逾期M2以上划扣"),
    信贷外贸2实时划扣("10050", "信贷外贸2实时划扣"), 
    信贷外贸2提前扣款("10051", "信贷外贸2提前扣款"), 
    信贷外贸2正常扣款("10052", "信贷外贸2正常扣款"), 
    信贷外贸2逾期M1划扣("10053", "信贷外贸2逾期M1划扣"), 
    信贷外贸2逾期M2以上划扣("10054", "信贷外贸2逾期M2以上划扣"),
    信贷包商银行实时划扣("10056","信贷包商银行实时划扣"),
    信贷包商银行提前扣款("10057","信贷包商银行提前扣款"),
    信贷包商银行正常扣款("10058","信贷包商银行正常扣款"),
    信贷包商银行逾期M1划扣("10059","信贷包商银行逾期M1划扣"),
    信贷包商银行逾期M2以上划扣("10060","信贷包商银行逾期M2以上划扣"),
    信贷华瑞渤海实时划扣("10063","信贷华瑞渤海实时划扣"),
    信贷华瑞渤海提前扣款("10064","信贷华瑞渤海提前扣款"),
    信贷华瑞渤海正常扣款("10065","信贷华瑞渤海正常扣款"),
    信贷华瑞渤海逾期M1划扣("10066","信贷华瑞渤海逾期M1划扣"),
    信贷华瑞渤海逾期M2以上划扣("10067","信贷华瑞渤海逾期M2以上划扣"),
    信贷陆金所实时划扣("10070","信贷陆金所实时划扣"),
    信贷陆金所提前扣款("10071","信贷陆金所提前扣款"),
    信贷陆金所正常扣款("10072","信贷陆金所正常扣款"),
    信贷陆金所逾期M1划扣("10073","信贷陆金所逾期M1划扣"),
    信贷陆金所逾期M2以上划扣("10074","信贷陆金所逾期M2以上划扣"),
    信贷外贸信托实时划扣("10077","信贷外贸信托实时划扣"),
    信贷外贸信托提前扣款("10078","信贷外贸信托提前扣款"),
    信贷外贸信托正常扣款("10079","信贷外贸信托正常扣款"),
    信贷外贸信托逾期M1划扣("10080","信贷外贸信托逾期M1划扣"),
    信贷外贸信托逾期M2以上划扣("10081","信贷外贸信托逾期M2以上划扣");
    /** value */
    private String value;

    /** code */
    private String code;

    private TPPInfoCategoryCodeEnum(String code, String value) {
        this.code = code;
        this.value = value;
    }

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public String getValue() {
        return value;
    }

    public void setValue(String value) {
        this.value = value;
    }
}
